FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ЗаказНарядЛайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БТ_ЗаказНарядЛайт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_КонтрагентыЛайт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_АвтомобилиЛайт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_НомерТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех проведения работ по заказ-наряду</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_АвтоработыЛайт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество работ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена в валюте документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество*Коэффициент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_НоменклатураЛайт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество работ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена в валюте документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество*Коэффициент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СопоставлениеДанныхHaval.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СопоставлениеДанныхHaval</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Данные1С</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопДанные1С</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СопоставлениеВидовРемонтаChangan.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СопоставлениеВидовРемонтаChangan</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДанныеChangan</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОплатыChangan</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СопоставлениеДанныхGeely.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СопоставлениеДанныхGeely</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Данные1С</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопДанные1С</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СопоставлениеДанныхAvatr.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СопоставлениеДанныхAvatr</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Данные1С</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопДанные1С</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ЗаказНарядЛайт/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	СуммаДокумента = Товары.Итог("Сумма") + работы.Итог("Сумма");
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхHaval.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхHaval КАК БТ_СопоставлениеДанныхHaval
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхHaval.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхHaval.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Бренд");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000045", Подразделение, Истина) Тогда
		
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение КАК Подразделение
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеПодразделенийChangan КАК БТ_СопоставлениеПодразделенийChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение = &Подразделение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхChangan.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхChangan КАК БТ_СопоставлениеДанныхChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхChangan.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхChangan.Данные1С = &Данные1С
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта КАК ВидРемонта,
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ДанныеChangan КАК ДанныеChangan,
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ТипОплатыChangan КАК ТипОплатыChangan
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеВидовРемонтаChangan КАК БТ_СопоставлениеВидовРемонтаChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта = &ВидРемонта");
	Запрос.УстановитьПараметр("Тип", "Бренд");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);

	Пакет = Запрос.ВыполнитьПакет();
	
	//БИЗТЕХ КОВАЛЬ 11.02.2025 - Добавил проверку по виду ремонта
	Если Не Пакет[0].Пустой() и Не пакет[1].Пустой() И НЕ Пакет[2].пустой() и 
		БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000039", Подразделение, Истина) Тогда
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGeely.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGeely КАК БТ_СопоставлениеДанныхGeely
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGeely.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхGeely.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("ZAZ000002", Подразделение, Истина) Тогда 
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGAC.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхGAC.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000056", Подразделение) Тогда
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхAvatr.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхAvatr КАК БТ_СопоставлениеДанныхAvatr
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхAvatr.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхAvatr.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой()
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("AVATR", Подразделение) Тогда

		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры
